[
    {
        "id": "1",
        "title": "UI Project - The Meditation App",
        "desc": "Build Mobile Application Frontend 1.\nThis is a personal project. Not for sale. I made a mobile app frontend of meditation app. I used Flutter framework. Let's see what's interesting bout this framework. \nThere are simple widget that I used such as container, row, and column. At the next level I try to costumize the widget. The \"Daily Meditations\" menu was using BoxDecoration widget. I need this widget to give an image to this container and also I want to give the radius of the corner of this container. Menu \"New Music\" is a carousel. I used ListView widget to build this carousel menu. How can I change the axis scroll of the that widget? It's simple, I just have to change the scroll direction. Build some widget into the children of the ListView widget. \n Yup, that's all from me. See you on the next frontend design.",
        "foto": [
            "assets/content/project/post1/post1-foto(1).png"
        ],
        "tags": [
            "UI",
            "Flutter"
        ],
        "type": "Mobile"
    },
    {
        "id": "2",
        "title": "UI Project - Presence App",
        "desc": "Build Mobile Application Frontend 2.\n\nYo, Welcome back with Fauzan. This is personal project. Not for sale. I made a mobile app frontend of online presence / attendance checker of my university. I build the concept \"one tap\" for check in attendance include the academic information system. Yup, it's just still frontend. I used Flutter Framework to develop this mobile app frontend.\n\nLet's see what's interesting of Flutter Framework on this project.\nI used some widget such as Container, Text, Column, and Row. At the next level, I customized the container using Box Decoration, gave it shadow and color. I used InkWell widget. Thus, the widget can response gesture from user like touch or tap. I used Cupertino Icons for this project because I was so curious about it. I think it looks cool when you have style of Apple's in your Android's. Widget Carousel of this project was the quite difficult to build. I used package from flutter named Carousel Slider. This package helps me to build the design. Last but not least, I built category menu using GridView builder. Basically, to use builder you just have to prepare the list of data do you need to build the widget.",
        "foto": [
            "assets/content/project/post2/post2-foto(1).png",
            "assets/content/project/post2/post2-foto(2).png",
            "assets/content/project/post2/post2-foto(3).png",
            "assets/content/project/post2/post2-foto(4).JPG",
            "assets/content/project/post2/post2-foto(5).JPG"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Mobile"
    },
    {
        "id": "3",
        "title": "App Project - FAM Note App 1",
        "desc": "Build Mobile Application Frontend 3.\n\nWelcome back again with Fauzan. This is personal project. Not for sale. I made a mobile app of notes to helps user to write in phone. I built this notes app with just simple view. This app help myself to write something whenever I forget to bring paper and pen.\n\nAs usual, I used flutter framework to build this mobile app. From the simple stage, I used container, row, and column to arrange the widget.\n\nThe next stage, I built the Note class with id, title, and description. And, every note saved will be filled to List. I used one of Flutter's state management which is Provider State. There are some parts of this state management. Those are Consumer, Provider, Change Notifier, and Change Notifier Provider.\n\nChange Notifier Provider will act in the root of the state. When I want to bring data, I used the Provider to call the method and method will alert the Change Notifier Provider there's data to the intended page. The method that called by Provider have to saved in the other class which extends Change Notifier class. Because the Change Notifier provides change to its listeners which is from Provider. Consumer works to call Provider for new Widget and implement it to the builder.\n\nThank you for reading my post.",
        "foto": [
            "assets/content/project/post3/post3-foto(1).png",
            "assets/content/project/post3/post3-foto(2).png",
            "assets/content/project/post3/post3-foto(3).png",
            "assets/content/project/post3/post3-foto(4).png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Mobile"
    },
    {
        "id": "4",
        "title": "UI Project - FAM Menu Makanan App",
        "desc": "Build Mobile Application Frontend 4.\n\nHello, it's me again, Fauzan. I made a personal project again using Flutter Framework. This project is a mobile frontend of Menu Application based Region in Indonesia. For further, this application will have a feature to show a recipe, history, and fun fact of the food. With the friendly and bright User Interface, this is app is fun to use.\n\nAt the simple stage, this project container widget, row, and column to arrange to view, from appbar to the gridview. This is interesting. Because flutter provide the feature to build grid of menu. In detail, you can use GridView with builder. Yeah, this feature helps me to build this project faster because I just have to build the statless/stateful widget of one grid and the builder will build it in repeated.\n\nMultiprovider helps me control flow data between state. I just have to prepare the model and bunch of the data from model (I put it in provider folder) stored in list and builded in class. Every class of the data have to extended with ChangeNotifier. There's so many ways to send data between state. I can pass the data at the initial of state with provider or I send it between class using builder or I send using Consumer.\n\nYeah that's all from me. Thank you for reading my post.",
        "foto": [
            "assets/content/project/post4/post4-foto(1).png",
            "assets/content/project/post4/post4-foto(2).png",
            "assets/content/project/post4/post4-foto(3).png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Mobile"
    },
    {
        "id": "5",
        "title": "App Project - FAM News using RESTful API",
        "desc": "This is my personal project. FAM News Application is an application that show list of news in Indonesia. There are some packages I used such as cupertino icons, get x, and http. In this project, I tried to implement free RESTful API from News API. \n\nThis app is one of my personal project that implements http package of flutter. I used http packages to get the data from News API. First step to get data from API, I had to add http package in pubspec and then import in the dart file. Next, I have to define the url data. Then, I have to build code to get data using http package. I had to build variable to keep response body from server API. At this step, there are so many approaches to convert response body from API. But, the legit thing I had to do is decode json, because the data from API is built with JSON format. \n\nThe other package I used is get x. Get x is state manager, navigation manager, and depedencies manager. This package is so easy to implement, stable, and fast. I used get to navigate between state. One of the interesting thing about get is I can define transition style of navigation state so easy and fast.",
        "foto": [
            "assets/content/project/post5/post5-foto(1).png",
            "assets/content/project/post5/post5-foto(2).png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Mobile"
    },
    {
        "id": "6",
        "title": "App Project - FAM Note App 2 with Firestore",
        "desc": "This is my app project using flutter framework that use firestore database. Actually, this is my another version of noteapp application. I made it using different tech resource. I've made noteapp application using provider state management and I store the data only to variables and it is temporary. \n\nTo use this app, I've to login to google account, because this app is made based on google's resource. After login, I can see the home page filled with the notes I've made. There's floating action button if I want to make new notes. To update the note, I just tap which note I want to edit, change the data, and save it. To delete it, I can tap on delete button.\n\nIn this project, I used cubit state management to handle the states. I think cubit is more flexible and lighter than bloc state management and suitable for mini-scale of applications like this. I could handled the state after login, handled state after I add new note, handled state after I delete the note, and handled state after I updated the note. \n\nTo store every note I've made, I used Cloud Firestore database. Of course, I must have a Google Account. Once again, Firestore have characteristic like cubit. I can legally say Firestore is more flexible, easier to scale and lighter than Firebase Realtime database. There is no tables or rows in Firestore. Firestore is a NoSql database, so I have to store the data as document and collection in Firestore. To handle route of app, I used GetX. GetX package is fast, stable, and I didn't have to write long like navigator of context and then push or pop like that. I just can write Get.to, Get.off, Get.back. It's simple\n\nYup, I think that's all from me. See you on another project.",
        "foto": [
            "assets/content/project/post6/post6-foto(1).png",
            "assets/content/project/post6/post6-foto(2).png",
            "assets/content/project/post6/post6-foto(3).png",
            "assets/content/project/post6/post6-foto(4).png",
            "assets/content/project/post6/post6-foto(5).png",
            "assets/content/project/post6/post6-foto(6).png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Mobile"
    },
    {
        "id": "7",
        "title": "UI Project - Infinite Bloc Listview",
        "desc": "This project is an experimental project to build panigation from the list of data builded in listview. I used bloc state management to control flow data from REST API and put them in home state.\n\nAt the start, I always build the model of the data. I have list of data around 100 row and I want to load it to screen as a little part, like only 10 row. I manipulated the parameter of url, and fill it with range of many lines I want. I got the data from REST API and then I controlled event-state with bloc and separating to two state. In brief, If I wanted to fetch another data, I used scroll controller to set new event and it will trigger the new state of new list from bloc.\n\nAs always, I will tell depedencies package do I use. I used dio as a replacement of http, bloc & flutter_bloc as a state management, and google fonts.",
        "foto": [
            "assets/content/project/post7/post7-foto(1).png",
            "assets/content/project/post7/post7-foto(2).png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Mobile"
    },
    {
        "id": "8",
        "title": "App Project - FAM Password Generator",
        "desc": "FAM Password generator is my personal project to generate password by randomize every character of the input.\n\nThe intersting part of this development project is I just have to used method shuffle from class List in dart to randomize each character from the line input\n\nI plan to continue the development of this project app.",
        "foto": [
            "assets/content/project/post8/post8-foto(1).png",
            "assets/content/project/post8/post8-foto(2).png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Mobile"
    },
    {
        "id": "9",
        "title": "App Project - FAM Logbook (CRUD MySql)",
        "desc": "This project called FAM Logbook because I used it to write log in mobile app. If you see from the screenshot, I just made the log based on a typical cart. Yeah I plan to continue development of this app so I can write any other type of log such as only text, or other type.\n\nTech resource I used in this project are MySQL Database, Dio depedencies, Cubit (but the thing is availaible include with bloc package), dartz, get, get_storage, screenutil.\n\nPlot how this app works: I build 2 role of account, admin and member. I separted it by type in database table, there's available 2 role admin and member. How do I fetch data from mysql? I used php file to get data, create, delete, and update. I called them as http client from flutter so I used Dio depedencies. Of course, I havev build the model of the data so I fetch and convert it to model inside codebase. The state management I used is cubit. At first, I didn't use cubit, I just used navigator. I combined cubit and get navigation manager to give me best experience of development. I set up the size of widget and text using screenutil. Screenutil helped to adapting widget size to the different screen size.\n\nThe great part of this development is I used get storage to save account session in local storage. Wow, this is interesting for me because basically I can understand the basic way of the other big app like facebook, google account, twitter, instagram, and many more to save account session in local.",
        "foto": [
            "assets/content/project/post9/post9-foto(1).png",
            "assets/content/project/post9/post9-foto(2).png",
            "assets/content/project/post9/post9-foto(3).png",
            "assets/content/project/post9/post9-foto(4).png",
            "assets/content/project/post9/post9-foto(5).png",
            "assets/content/project/post9/post9-foto(6).png",
            "assets/content/project/post9/post9-foto(7).png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Mobile"
    },
    {
        "id": "10",
        "title": "App Project - Fauzan's Lab Web Portfolio",
        "desc": "This is my online portfolio. I made this website using Flutter Framework. \n\nUnique experience of development website using Flutter Framework is like I was able to control development html, css, and javascript in one single codebase. But, Flutter gave me strange experience to control the route of this website.\n\nLet me tell you something how does Flutter for web works. Flutter uses entire screen as a canvas and creates its own HTML. And the screen is rendered with engine called Skia. So, instead load the single page like native development. FLutter website load all the page of the web like Mobile Application.\n\nI used netlify hosting to deploy this portfolio website. It was easy to use, lighter, and free.\n\nThe development of this website is still continuing due to adding more data and improving performance of the website.",
        "foto": [
            "assets/content/project/post10/post10-foto(1).jpg",
            "assets/content/project/post10/post10-foto(2).jpg",
            "assets/content/project/post10/post10-foto(3).jpg",
            "assets/content/project/post10/post10-foto(4).jpg",
            "assets/content/project/post10/post10-foto(5).jpg",
            "assets/content/project/post10/post10-foto(6).jpg",
            "assets/content/project/post10/post10-foto(7).jpg",
            "assets/content/project/post10/post10-foto(8).jpg",
            "assets/content/project/post10/post10-foto(9).jpg",
            "assets/content/project/post10/post10-foto(10).jpg",
            "assets/content/project/post10/post10-foto(11).jpg",
            "assets/content/project/post10/post10-foto(12).jpg"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Web"
    },
    {
        "id": "11",
        "title": "UI Project - Accessories Marketplace",
        "desc": "Build Mobile Application Frontend 5.\n\nSlicing UI from Fauzan Akmal Mahdi.\n\nThis is my other project of mobile app frontend UI or slicing UI only. This is an marketplace app of accessories music and phone.\n\nI have 4 pages of this app but I've develop completely in first page, but I'll continue the development of this project.\n\nThank you.",
        "foto": [
            "assets/content/project/post11/post11-foto(1).png",
            "assets/content/project/post11/post11-foto(2).png",
            "assets/content/project/post11/post11-foto(3).png",
            "assets/content/project/post11/post11-foto(4).png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Mobile"
    },
    {
        "id": "12",
        "title": "UI Project - Payment App",
        "desc": "Build Mobile Application Frontend 6.\n\nSlicing UI from Fauzan Akmal Mahdi.\nThis is my other project of mobile app frontend UI or slicing UI only. This is slicing UI of payment app.\nI have 4 pages of this app but I've develop completely in first page, but I'll continue the development of this project.\nThank you.",
        "foto": [
            "assets/content/project/post12/post12-foto(1).png",
            "assets/content/project/post12/post12-foto(2).png",
            "assets/content/project/post12/post12-foto(3).png",
            "assets/content/project/post12/post12-foto(4).png",
            "assets/content/project/post12/post12-foto(5).png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Mobile"
    },
    {
        "id": "13",
        "title": "App Project - FAM Expense Log",
        "desc": "This is an App Project of Fauzan Akmal Mahdi. \n\nI build an app to write a log of expense of personal finance. This is very helpful app because I just have to open the app and add the log. I just have to input the title, description, and the date. If I forgot something about my finance, I can open the app and look at the description. \n\nThere are packages I used: I developed this app using SQLite to store the data. SQLite is very light and fast in access. And then, I used screenutil to handle the size of the app based on screen size. For the navigation I used Getx as usual. Getx is very helpful package and easy to use. And I used google fonts as a font of the app. I think using google fonts package gives me an experience to flexibility of using every font style.\n\nJust like that. Simple.\nThank you.",
        "foto": [
            "assets/content/project/post13/post13-foto(1).png",
            "assets/content/project/post13/post13-foto(2).png",
            "assets/content/project/post13/post13-foto(3).png",
            "assets/content/project/post13/post13-foto(4).png",
            "assets/content/project/post13/post13-foto(5).png",
            "assets/content/project/post13/post13-foto(6).png",
            "assets/content/project/post13/post13-foto(7).png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Mobile"
    },
    {
        "id": "14",
        "title": "App Project - FAM Profile Log CRUD Cloud Firestore",
        "desc": "This is an App Project of Fauzan Akmal Mahdi. \n\nThis is an log application to add, update, and delete a profile. This application implements cloud firestore to keep the data.\n\nThere are some external packages I used to develop this application such as: cloud firestore to store the data. I used screenutil to handle the widget size of the application. For the page navigation I used Get package. Getx is very helpful package and easy to use. And I used google fonts as a font of the app. \nFlutter google fonts gave flexibility to set and try many font style family available. And I can choose the font I want to implement to the app font style or font famliy.\n\nAlso, to control the state management of this app I used flutter bloc state management. The best part of implements state management is when I set bloc consumer on the presentation or screen layers.\nThere are some state I have to defined like loading, error, success. And the events like add list, update list, and delete list.\n\nThere will be further development to this app such as improving clean architecture and memory management.\nThank you.",
        "foto": [
            "assets/content/project/post14/post14-foto(1).png",
            "assets/content/project/post14/post14-foto(2).png",
            "assets/content/project/post14/post14-foto(3).png",
            "assets/content/project/post14/post14-foto(4).png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Mobile"
    },
    {
        "id": "15",
        "title": "App Project - FAM Restaurant App (Dicoding's Course)",
        "desc": "This is an App Project of Fauzan Akmal Mahdi. \n\nThis application is the submission project of Dicoding's course Belajar Pengembangan Aplikasi Flutter. This application has simple purpose which is to implement the general goal of mobile app development.\n\nThe general purpose of mobile app development is to develop the user interface, user interaction, build client-side logic and also consuming API from the backend.\n\nDicoding course gave me the basic rule of this project. I just have to show the list of restaurant, and navigate to the detail of restaurant. But the data of restaurant is available in dicoding API. So I have to fetch and show to the app screen.\n\nI developed the app using cupertino style, which I rarely used to style. I'm very excited because the cupertino style almost similar with iOS style. And this made me so curious. And I used bloc state management of this app because I think this helps me to improve my skills to control state management.\n\nThe external packages I used are screenutil, dio, flutter bloc, getx, and dartz.\n\nThank you.",
        "foto": [
            "assets/content/project/post15/post15-foto(1).png",
            "assets/content/project/post15/post15-foto(2).png",
            "assets/content/project/post15/post15-foto(3).png",
            "assets/content/project/post15/post15-foto(4).png",
            "assets/content/project/post15/post15-foto(5).png",
            "assets/content/project/post15/post15-foto(6).png",
            "assets/content/project/post15/post15-foto(7).png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Mobile"
    },
    {
        "id": "16",
        "title": "App Project - Relaone",
        "desc": "This is a mobile application project is done by Fauzan Akmal Mahdi. \n\nThe purpose of this application is to connect volunteer and event owner or organization. Based on it's name \"Relone\" came from \"Relawan\" or \"Volunteers\". \n\nThere are 3 roles of user of the app. Volunteer, Organization, and Admin. \nEach role have different scope ability. Volunteer can only sign up & sign in an account and join available events. Organization can create event, accept & reject volunteers. And Admin can approve and reject event submitted.\nThis app have notification features.\n\nFrom the tech side, this mobile app is developed using flutter 3.7.6. Implement clean design pattern and clean architecture.\n\nSome of the packages used include:\n- flutter_inappwebview is used to open outside link inside the app\n- firebase, implement remote config\n- get_storage as local storage of the app\n- bloc as state management\n- dio as HTTP client for Dart/Flutter,\n- image_picker to get image from local phone",
        "foto": [
            "assets/content/project/post16/post16-foto(1).png",
            "assets/content/project/post16/post16-foto(2).png",
            "assets/content/project/post16/post16-foto(3).png",
            "assets/content/project/post16/post16-foto(4).png",
            "assets/content/project/post16/post16-foto(5).png",
            "assets/content/project/post16/post16-foto(6).png",
            "assets/content/project/post16/post16-foto(7).png",
            "assets/content/project/post16/post16-foto(8).png",
            "assets/content/project/post16/post16-foto(9).png",
            "assets/content/project/post16/post16-foto(10).png",
            "assets/content/project/post16/post16-foto(11).png",
            "assets/content/project/post16/post16-foto(12).png",
            "assets/content/project/post16/post16-foto(13).png",
            "assets/content/project/post16/post16-foto(14).png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Mobile"
    },
    {
        "id": "17",
        "title": "App Project - I-TKD FAM",
        "desc": "This is a mobile application project of Fauzan Akmal Mahdi. \n\nThe purpose of this project is to finish my thesis (bachelor's degree) entitled Implementation of Convolutional Neural Network Algorithm for Android-Based Classification of Taekwondo Martial Arts.\nThe application has feature to identify taekwondo movement by image which can be taken using camera or from gallery. \n\nBefore I develop the app, I develop the machine learning model using Convolutinal Neural Network model using python. I have implemented tensorflow into this application so it can run machine learning models.\nWith tensorflow lite the model can be used inside mobile application in offline mode (without active network). \n\nFrom the tech side, there are some pacakges I've used include:\n- tensorflow lite to run machine learning models inside mobile app\n- using flutter bloc as state management\n- using get storage as local storage\n- using firebase to implement remote config because I developed the app in limited scope of users and research purpose.",
        "foto": [
            "assets/content/project/post17/post17-foto(1).jpeg",
            "assets/content/project/post17/post17-foto(2).jpeg",
            "assets/content/project/post17/post17-foto(3).jpeg",
            "assets/content/project/post17/post17-foto(4).jpeg",
            "assets/content/project/post17/post17-foto(5).jpeg",
            "assets/content/project/post17/post17-foto(6).jpeg",
            "assets/content/project/post17/post17-foto(7).jpeg",
            "assets/content/project/post17/post17-foto(8).jpeg"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Mobile"
    },
    {
        "id": "18",
        "title": "App Project - Vehicle Management Logs",
        "desc": "This is fullstack project of Fauzan Akmal Mahdi. \n\nI developed frontend mobile using flutter and backend using golang.\n\nThe purpose of this app is to manage vehicle maintenance logs and for further I will submit the app to Google Play Store.\nUser can control their vehicle maintenance logs, see expenses by log and chart, get notification for next maintenance by expected odo.\n\nSome pacakges I've used include\n- syncfusion_flutter_charts to display maintenance data logs and expense of users vehicles\n- connectivity plus is to handle connectivity context of the users device\n- dio as http client\n- bloc as state management\n- flutter_screenutil to set widget size by device size\n- hive as local storage\n- package_info_plus to get device info",
        "foto": [
            "assets/content/project/post18/post18-foto(1).png",
            "assets/content/project/post18/post18-foto(2).png",
            "assets/content/project/post18/post18-foto(3).png",
            "assets/content/project/post18/post18-foto(4).png",
            "assets/content/project/post18/post18-foto(5).png",
            "assets/content/project/post18/post18-foto(6).png",
            "assets/content/project/post18/post18-foto(7).png",
            "assets/content/project/post18/post18-foto(8).png",
            "assets/content/project/post18/post18-foto(9).png",
            "assets/content/project/post18/post18-foto(10).png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Mobile"
    },
    {
        "id": "19",
        "title": "Flutter Package - Responsive Multipage Application Web",
        "desc": "This is flutter package project of Fauzan Akmal Mahdi.\n\nI developed this package is to help people build web using flutter that imitated multipage application. Because flutter only support flutter web as single page application.\n\nThe web that developed by this package can have different route and different page. And so developer can focus improve their code to screens and performance.\n\nI have published this package to pub.dev listed on this link https://pub.dev/packages/responsive_mpa_web",
        "foto": [
            "assets/content/project/post19/post19-foto(1).png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Web"
    },
    {
        "id": "20",
        "title": "Backend - Relaone Backend Service (Golang)",
        "desc": "This is backend project of Fauzan Akmal Mahdi.\n\nThe project developed using Golang language, database I've used is MySql Phpmyadmin, and the library I've used like gin for http web framework and gorm to handle relational mapping service.\n\nThere are 3 roles of user of the app. Volunteer, Organization, and Admin. \nEach role have different scope ability. Volunteer can only sign up & sign in an account and join available events. Organization can create event, accept & reject volunteers. And Admin can approve and reject event submitted.\nThis service has notification features.\n\nFrom the Account models, I've built endpoint service for all role users\n- sign up account \n- sign in account\n- get user data\nin this service I developed security like jwt token. So all service is secure to security attacks.\n\nFrom the Event models, I've built endpoint service \n- get all event (for all roles)\n- create event (for organization role)\n- join event (for volunteer role)\n- submit volunteer (for organization role)\n- submit event (for admin role to approve or reject event added)\n- get list volunteers (for admin and organization roles)\nevery action for create event, join event, submit volunteer, and submit event will add notification to the table notification. But I don't add push notification service on this case, only add data to the table notification.\n\nFrom the Notification models, I've built endpoint service  \n- get notification (for all roles)",
        "foto": [
            "assets/content/project/post16/post16-foto(1).png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Backend"
    },
    {
        "id": "21",
        "title": "Backend - Vehicle Management Logs Backend Service (Golang)",
        "desc": "This is backend project of Fauzan Akmal Mahdi.\n\nThe project developed using Golang language, database used is MySql Phpmyadmin, and the library I've used like gin for http web framework and gorm to handle relational mapping service.\n\nThis service has notification features.\n\nFrom the Account models, I've built endpoint service for all role users\n- sign up account \n- sign in account\n- get user data\nin this service I haven't developed security like jwt token. So all service all vulnerable to security attacks.\n\nFrom the Vehicle models, I've built endpoint service \n- get all vehicle\n- create vehicle\n- update vehilce data\n- create log vehicle \n- get log vehicle\nevery action for create vehicle, update vehicle data, create log vehicle, will add notification to the table notification. But I don't add push notification service on this case, only add data to the table notification.\n\nFrom the Notification models, I've built endpoint service  \n- get notification ",
        "foto": [
            "assets/content/project/post18/post18-foto(1).png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Backend"
    },
    {
        "id": "22",
        "title": "Conv Neural Network - Identify Taekwondo Movement",
        "desc": "This is machie learning project of Fauzan Akmal Mahdi.\n\nI've developed deep learning method using Convolutinal Neural Network algorithms to identify Taekwondo movements based on image.\n\nIn Taekwondo, there is a demonstration of a series of movements called poomsae. Currently, judging in poomsae competitions is still done by humans. There is a Deep Learning method that can be used to make the image learning function more efficient and effective with the Convolutional Neural Network algorithm. \nThe Convolutional Neural Network algorithm utilizes the convolution function to process input data in the form of images to be processed by the model so that classification can be done. \n\nThis study uses image data in the form of 6 types of Taekwondo martial arts movements. \n\nThis study compares the effect of the number of convolution layers, the number of hidden layers, and the use of dropout layers on increasing the accuracy of the test data. \nThe results of the highest test data accuracy were obtained in the scenario of using 6 convolution layers, 3 hidden layers, and without a dropout layer of 61.28%. \n\nBy using the Tensorflow library to create a convolutional network model, it is easy to integrate the model into an Android-based mobile application. \nTherefore, the researcher will implement the advantages of the Convolutional Neural Network algorithm to classify movements in Taekwondo martial arts through input data in the form of images into an Android-based mobile application.\n\nI've published this research on IEEE Explore referring to this link https://ieeexplore.ieee.org/abstract/document/10017502",
        "foto": [
            "assets/content/project/post22/post22-foto(1).png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Machine Learning"
    },
    {
        "id": "23",
        "title": "LSTM - Stock Prediction",
        "desc": "This is machie learning project of Fauzan Akmal Mahdi.",
        "foto": [
            "assets/content/project/post22/post22-foto(1).png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Machine Learning"
    },
    {
        "id": "24",
        "title": "React JS - Portfolio Web 1",
        "desc": "Slicing Portfolio User Interface of Web Application using React JS and Tailwind. See more on this link Visit https://reactjs-template-4.vercel.app/",
        "foto": [
            "assets/content/project/post24/post24.png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Web"
    },
    {
        "id": "25",
        "title": "React JS - Portfolio Web 2",
        "desc": "Slicing Portfolio User Interface of Web Application using React JS and Tailwind. See more on this link Visit https://react-portfolio-fam1.vercel.app/",
        "foto": [
            "assets/content/project/post25/post25.png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Web"
    },
    {
        "id": "26",
        "title": "React JS - Dashboard Web 1",
        "desc": "Slicing Dashboard Web User Interface of Web Application using React JS and Tailwind. See more on this link Visit https://reactjs-openshop-dashboard.vercel.app/",
        "foto": [
            "assets/content/project/post26/post26.png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Web"
    },
    {
        "id": "27",
        "title": "React JS - Dashboard Web 2",
        "desc": "Slicing Dashboard Web User Interface of Web Application using React JS and Tailwind. See more on this link Visit https://reactjs-dashboard-1.vercel.app/",
        "foto": [
            "assets/content/project/post27/post27.png"
        ],
        "tags": [
            "App",
            "Flutter"
        ],
        "type": "Web"
    }
]